---
kind: method
id: M:Autodesk.Revit.DB.Document.Dispose
zh: 文档、文件
source: html/3c64e1bd-1db3-0a71-c9fa-f70e136cd676.htm
---
# Autodesk.Revit.DB.Document.Dispose Method

**中文**: 文档、文件

Releases all resources used by the Document

## Syntax (C#)
```csharp
public void Dispose()
```